8amjp.charactercount
aaron-bond.better-comments
anysphere.cursorpyright
austenc.tailwind-docs
bajdzis.vscode-database
bierner.markdown-mermaid
bourhaouta.tailwindshades
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
bung87.vscode-gemfile
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chrmarti.regex
codezombiech.gitignore
csholmq.excel-to-markdown-table
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
eg2.vscode-npm-script
esbenp.prettier-vscode
fabiospampinato.vscode-todo-plus
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.next-js
fwcd.kotlin
geeksharp.openssl-configuration-file
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
golang.go
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
hediet.vscode-drawio
hediet.vscode-drawio-insiders-build
humao.rest-client
ibm.output-colorizer
ics.japanese-proofreading
ionutvmi.path-autocomplete
jebbs.plantuml
kevinrose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
mariusalchimavicius.json-to-ts
marp-team.marp-vscode
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
mosapride.zenkaku
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-vscode.copilot-mermaid-diagram
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
msjsdiag.debugger-for-chrome
mtxr.sqltools
njpwerner.autodocstring
nopeslide.vscode-drawio-plugin-mermaid
oderwat.indent-rainbow
pkief.material-icon-theme
rebornix.ruby
ritwickdey.liveserver
rmnl.theme-solarized-flat-dark
ryu1kn.partial-diff
saoudrizwan.claude-dev
shardulm94.trailing-spaces
sianglim.slim
stylelint.vscode-stylelint
tabnine.tabnine-vscode
taichi.vscode-textlint
vincaslt.highlight-matching-tag
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
wix.vscode-import-cost
yzhang.markdown-all-in-one
zxh404.vscode-proto3
