aaron-bond.better-comments
akamud.vscode-theme-onedark
alefragnani.bookmarks
amazonwebservices.amazon-q-vscode
amazonwebservices.aws-toolkit-vscode
arjun.swagger-viewer
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
chrmarti.regex
codezombiech.gitignore
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
fabiospampinato.vscode-todo-plus
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
foxundermoon.next-js
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
gruntfuggly.todo-tree
hashicorp.terraform
hbenl.vscode-test-explorer
hediet.vscode-drawio
humao.rest-client
ibm.output-colorizer
ics.japanese-proofreading
ijs.reactnextjssnippets
ionutvmi.path-autocomplete
janisdd.vscode-edit-csv
jebbs.plantuml
johnpapa.vscode-peacock
leodevbro.blockman
mariusalchimavicius.json-to-ts
mechatroner.rainbow-csv
mikestead.dotenv
mohammadbaqer.better-folding
mosapride.zenkaku
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
omartawfik.github-actions-vscode
pkief.material-icon-theme
redhat.java
redhat.vscode-yaml
ritwickdey.liveserver
ryu1kn.partial-diff
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
sohamkamani.code-eol
streetsidesoftware.code-spell-checker
tintinweb.graphviz-interactive-preview
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wix.vscode-import-cost
wmaurer.change-case
yzane.markdown-pdf
