# Cursor 拡張機能リスト
# 1行1拡張ID。# 始まりはコメント。空行OK。
# 同期: `make cursor-sync`（dotfilesルートで実行）

# --- Core: TS/React/Next ---
dbaeumer.vscode-eslint
esbenp.prettier-vscode
stylelint.vscode-stylelint
bradlc.vscode-tailwindcss
ecmel.vscode-html-css
christian-kohler.path-intellisense
editorconfig.editorconfig
usernamehw.errorlens
yoavbls.pretty-ts-errors
mikestead.dotenv

# --- テスト ---
vitest.explorer
ms-playwright.playwright

# --- Java (vscjava.vscode-java-pack が下記を束ねる) ---
vscjava.vscode-java-pack
redhat.java
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-java-dependency
vscjava.vscode-maven
vscjava.vscode-gradle

# --- データ/ORM ---
prisma.prisma

# --- Git / PR / GitHub ---
eamodio.gitlens
github.vscode-pull-request-github
github.vscode-github-actions

# --- 品質 ---
streetsidesoftware.code-spell-checker

# --- UI / UX ---
pkief.material-icon-theme
github.github-vscode-theme
aaron-bond.better-comments
oderwat.indent-rainbow
shardulm94.trailing-spaces
gruntfuggly.todo-tree
ms-ceintl.vscode-language-pack-ja

# --- Markdown / ドキュメント ---
yzhang.markdown-all-in-one
davidanson.vscode-markdownlint
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
marp-team.marp-vscode
hediet.vscode-drawio
ics.japanese-proofreading

# --- その他業務 ---
ms-azuretools.vscode-docker
redhat.vscode-yaml
mechatroner.rainbow-csv
humao.rest-client
