aaron-bond.better-comments
alefragnani.bookmarks
alefragnani.project-manager
cardinal90.multi-cursor-case-preserve
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.github-vscode-theme
gruntfuggly.todo-tree
mhutchie.git-graph
mikestead.dotenv
oderwat.indent-rainbow
rvest.vs-code-prettier-eslint
streetsidesoftware.code-spell-checker
tejasvi.rainbow-brackets-2
usernamehw.errorlens
vscode-icons-team.vscode-icons
wix.vscode-import-cost
yanesnicolas.next-react-es7-snippets
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
