aaron-bond.better-comments
alefragnani.bookmarks
alefragnani.project-manager
cardinal90.multi-cursor-case-preserve
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.github-vscode-theme
golang.go
gruntfuggly.todo-tree
llvm-vs-code-extensions.vscode-clangd
meta.pyrefly
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
oderwat.indent-rainbow
redhat.java
rvest.vs-code-prettier-eslint
shopify.ruby-lsp
streetsidesoftware.code-spell-checker
tejasvi.rainbow-brackets-2
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wix.vscode-import-cost
yanesnicolas.next-react-es7-snippets
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
